Revit 2024 API
ACADExportOptions.ACAPreference Property
 The preferred way to generate geometry of ACA objects. Default value is ACAObjectPreference.Object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ACAObjectPreference ACAPreference { get; set; }
Visual Basic
Public Property ACAPreference As ACAObjectPreference
	Get
	Set
Visual C++
public:
property ACAObjectPreference ACAPreference {
	ACAObjectPreference get ();
	void set (ACAObjectPreference value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace